# CC_OnFindAndReplace

## Description
Custom find and replace fuctionality for ConnectCAD objects.

```pascal
PROCEDURE CC_OnFindAndReplace(
				hObject    : HANDLE;
				fieldName  : STRING;
				fieldValue : STRING);
```

```python

def vs.CC_OnFindAndReplace(hObject, fieldName, fieldValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|fieldName|STRING||
|fieldValue|STRING||

## Version
Availability: from Vectorworks 2023.6
## Category
* ConnectCAD